def ryba():
    return "web2py provides its users with the generous freedoms of the LGPL open source licence. If you benefit from it, I hope you will feel encouraged to pay it forward by contributing back to society in whatever form you choose."


def ryba2():
    """ page rendered by template simple_examples/index3.html or generic.html"""

    return dict(message="web2py provides its users with the generous freedoms of the LGPL open source licence. If you benefit from it, I hope you will feel encouraged to pay it forward by contributing back to society in whatever form you choose.")


def jupe1():
    """ page rendered by template simple_examples/index3.html or generic.html"""

    return dict(message=jupe_text)

def jupe3():
    """ page rendered by template simple_examples/index3.html or generic.html"""

    return dict(content=jupe_text)

def jupe2():
    """ page rendered by template jupe2.html or generic.html"""

    return dict(jupe_text=jupe_text)


jupe_text = '''
<h1>новый тренд этой  зимы:
ЮБКА ДЛЯ УЛИЦЫ</h1>

Слева: <h2>Для тех, кто ненавидит рейтузы</h2>
Справа: Мы поможем вам грамотно перезимовать

У девушек всегда куча каких-то странных проблем. Так было во все времена. Но особенно их много бывает зимой…
Хочется поехать на работу в короткой юбке, а на улице мороз. Значит, либо застудить придатки/заработать цистит - либо опять надевать эти дурацкие рейтузы, а потом торопливо снимать их в кабинке туалета.
О кей, одеваешься по погоде, приезжаешь в офис в длинной и страшно теплой юбке, а там батареи жарят во всю дурь, и уже к обеду ты ловишь себя на мысли, что сейчас снимешь с себя эту чертову юбку и будешь сидеть за компом в одних колготках.
Хочется явиться на вечеринку в красивом платье, а новая модная куртка - короткая, и если из-под нее будет «вытарчивать» платье, это будет смотреться, мягко говоря, по-уродски.
Хочется покататься на коньках, а в чем идти на открытый каток – непонятно. В обычной юбке – холодно, в джинсах – жмет и «ласточку» толком не сделаешь, в длинной куртке – не гламурненько как-то.
Не хочется носить всю зиму теплое длинное универсальное пальто, хочется быть разной – но где же взять столько денег?
Знакомая тема? А теперь слушайте, как всё это побороть. И всего-то за 3 с половиной тысячи рублей.
Все знают, что такое полупальто. Это как бы пальто, но только верхняя его часть. И никто не задумывался – а куда подевалась нижняя? Ведь если есть полупальто «сверху», значит, должно быть и полупальто «снизу».
Именно этим является инновационная юбка на «липучке» от российско-шведского бренда SKADI DESIGN GROUP, кредо которой – «создавать вещи, базирующиеся на философии "умного" дизайна».
3 фотки по горизонтали:
Солнце короткая
Солнце длинная
Офис-леди
Покупая юбку модели «Зимнее солнце» или «Офис-леди», вы приобретаете фактически верхнюю одежду – то есть логическое продолжение для вашей зимней куртки. Эту юбку вы можете надеть поверх одежды, в которой вы собираетесь ходить в помещении.  Просто для тепла. Впрочем, красоту тоже никто не отменял! (кнопка "Заказать сейчас")
Даша К., студентка Британской Академии дизайна в Москве: «Я выбрала модель «Зимнее солнце» - ту, что подлиннее (кнопка "Заказать сейчас"). Ношу на обе стороны – черную и голубую. Под низ поддеваю еще леггинсы. Оставляю в гардеробе вместе с курткой или складываю в упаковочную сумочку и беру в рюкзачке с собой. Очень удобная вещь, вся группа накупила их следом за мной».
Алина С., менеджер: «Меня очень выручает юбка «Офис-леди» (кнопка "Заказать сейчас"). Люблю носить мини, мама всегда ругалась и заставляла надевать шерстяные рейтузы. Теперь утепляюсь инновационно. Прихожу в офис и спокойно снимаю».
Аня Б., продавец-консультант: Купила юбку «Зимнее солнце», длинную (кнопка "Заказать сейчас"), надела ее на нарядное шелковое платьице, поехали с мужем на свадьбу к его другу. Три часа шлялись по морозу, фотографировались на всех смотровых площадках и мостах.  Приходим в кафе, и вдруг я в гардеробе начинаю… снимать юбку! Муж чуть в обморок не упал. Потом разобрались, смеялись долго. А невеста друга сказала: «Эх, знала бы раньше, не мерзла бы весь день в тонком свадебном платье и меховой накидке до пупа». Хорошее изобретение, что правда, то правда»).
Саша К., тренер по фигурному катанию: «У меня вся группа катается в юбках «Зимнее солнце» (кнопка "Заказать сейчас"). Тех, которые короткий вариант, разлетайка. Покупали сразу на всех, по льготной оптовой цене. Я считаю, для катка – это идеально. Черные теплые леггинсы поддеваем обязательно, а иногда под них еще и плотные шорты. И носить можно на разные стороны, в зависимости от настроения. У меня черная с белым – я в ней еще и Снегурочкой на Новый год подрабатываю».
Полина И., экскурсовод: «Я купила себе сразу две юбки – широкую и узкую. Одна -  черно-серая до колен, «Офис-леди» (кнопка "Заказать сейчас"), другая – длинный вариант «Зимнее солнце» (кнопка "Заказать сейчас"). В итоге имею как бы 4 юбки – и все теплые. Ношу в самых разных сочетаниях – и по цвету, и по степени утепленности. Для меня это важно, так как работаю на свежем воздухе. В самые холодные дни надеваю даже под длинное пальто, а если погода позволяет, то можно и пофорсить с приталенной курточкой. Особенно элегантно получается «солнце» на черную сторону с черным же верхом. И черная вязаная шляпа с полями. Выглядит а ля 19-й век, про который я и рассказываю».
Надежда Ц., врач-педиатр: «Мне кажется, в скором времени юбка для улицы станет обычным предметом гардероба. По-моему, она должна быть у каждой женщины, проживающей в климате с холодной зимой и довольно-таки грязной осенью. Отлично спасает от холода и ветра, а если запачкается брызгами, можно просто на другую сторону перевернyть, а потом, уже дома, протереть влажной губкой. В общем, полезная вещь, однозначно. Мне еще и фигуру поддерживать помогает. Хочется как-то постройнее быть, чтоб поясу на талии было что подчеркивать».
Заказать сейчас
Описание шагов по заказу:
выбери юбку,
поставь галочки в форме заказа,
укажи адрес для доставки
жди СМСку или электронное письмо об отправке посылки в течение 2 недель.
Получи на почте рядом с домом.
Форма заказа
Юбка. Места, где ставить галочки (размер один из двух, цвет один из трех),
Сумочка за доп. плату – да или нет.
Оформить (присваивается номер заказа и и примерный срок поставки. Поставь галочку "Я принимаю условия"
Всплывающее окошко с фразой: «С этим товаром обычно заказывают…» + фотка сумочки с подписью: "Сумочка для хранения юбки"
Доставка и оплата
Доставка 300 руб. в любой город России
Оплата наложенным платежом при получении
У нас надежно и удобно
Гарантируем качество
Гарантируем отправку товара  в течение 2 недель (за срывы сроков почтой мы не отвечаем, но вроде бы почта работает нормально в последнее время)
Возвращаем деньги, если товар не понравился (пересылка за счет клиента)
Заменяем товар (или возвращаем деньги) в случае брака (доставка за счет фирмы)
Никакой предоплаты: покупка оплачивается при получении, а не до!
Сезонная акция: «Себе и подружкам»
Купи две юбки и сэкономь на доставке 300 руб. или получи в подарок сумочку для хранения - Фотка с со стрелочками – себе, Маше
Купи три юбки и получи скидку 600 руб. - Фотка с со стрелочками – себе, Маше Ане
Купи пять юбок и получи оптовую цену 2700 руб. - Фотка с со стрелочками – себе, Маше, Ане, еще одной Ане, Даше
Написать нам
Форма для письма.
Наш телефон
Наш мейл
Название нашего юрлица.
Материалы и технологии
Верх - качественная плащевая ткань
Внутри - синтепон и спандбонд, чтоб синтепон не сыпался
Подкладка – тоже плащевая ткань, т.к. юбка двухсторонняя
Идеально ровная строчка
Контроль качества на каждом этапе производства
Ткани и фурнитура изготовлены в Южной Корее и Восточной Европе по современным технологиям
Юбка не промокает, не мнется, не электризуется
Легко стирается обычным порошком (выдерживает 500 стирок на деликатной стирке, при этом не теряет объем, благодаря слою спандбонда)
Быстро сохнет
Несложные пятна можно просто слегка потереть влажной тряпочкой

'''
